# TEST_remote_Git

# Очищаю список переменных в рабочей зоне
#....................................................................
rm(list=ls())

# Устанавливаю необходимые пакеты
#....................................................................
#install.packages("telegram.bot")
#install.packages("tidyverse")
#install.packages("stringr")
#install.packages("readr")


# S E R V I S E   A C T I O N S
# libraries & Autorisation
#####################################################################
# Подключаю библиотеки
#....................................................................
library(telegram.bot) # операции с телеграм ботом
library(stringr) # работа с текстом
#####################################################################

# P R E P A R E   D A T A   F O R   T E L E G R A M   M E S S A G E S
#####################################################################

# ...................................................................
current_datetime <- date()

tg_msg <- paste("Hallo from Git ", current_datetime)
print(tg_msg)
#####################################################################

# T E L E G R A M   B O T   S E T T I N G S 
#####################################################################
#____________________________________________________________________
# ОПРЕДЕЛЯЮ КРЕДЫ TELEGRAM BOT

# Получаю токен чата. 
# ...................................................................
token_bot <- "6357926545:AAEmcTZEDN90NpfFaO0y95y32OipyWFQquM" # @alex_hanna_test_bot

# Инициализация бота
# ...................................................................
bot <- Bot(token_bot)
print(bot$getMe())

# Получаю список обновлений бота. Необходимо для определения ID чата. Один раз.
# ...................................................................
#updates <- bot$getUpdates()

# Определяю ID чата.
# ...................................................................
chat_id_alex <- 459064875 # @PolAlexey

# Формирую вектор с пользователями, которые будут получать сообщения
# ...................................................................
chat_ids <- c(chat_id_alex)

# Очищаю константы, промежуточные и проверочные вычисления
# ...................................................................
rm(chat_id_alex)
#####################################################################

# S E N D I N G   M E S S A G E S
#####################################################################

# ___________________________________________________________________ 
# TEXT

# Отправляю сообщение в telegram
# ...................................................................
for(id in chat_ids) {
  bot$send_message(chat_id = id,
                   text = tg_msg,
                   parse_mode = 'markdown')
  print(id)}
#####################################################################